ai_org/public_html/courses/fast_ai_dl_course/lesson1.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-01-31 Wed 09:35 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Monib Ahmed" />
</head>
<body>
<div id="content">
<div id="outline-container-org3e0de3c" class="outline-2">
<h2 id="org3e0de3c"><span class="section-number-2">1</span> Lesson 1</h2>
<div class="outline-text-2" id="text-1">
<p>
<a href="http://forums.fast.ai/t/wiki-lesson-1/9398">http://forums.fast.ai/t/wiki-lesson-1/9398</a>
</p>
</div>
</div>
<div id="outline-container-org59e4811" class="outline-2">
<h2 id="org59e4811"><span class="section-number-2">2</span> Use a GPU (Nvidia)</h2>
</div>
<div id="outline-container-orgc8a5111" class="outline-2">
<h2 id="orgc8a5111"><span class="section-number-2">3</span> Options:</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li>crestle.com</li>
<li>paperspace.com (0.40/hr + $5/month) &#x2013;</li>
<li></li>
</ol>
</div>
</div>

<div id="outline-container-org8a54e83" class="outline-2">
<h2 id="org8a54e83"><span class="section-number-2">4</span> Paperspace Setup​</h2>
<div class="outline-text-2" id="text-4">
<p>
curl <a href="http://files.fast.ai/setup/paperspace">http://files.fast.ai/setup/paperspace</a> | bash
</p>
</div>
</div>

<div id="outline-container-orga1dce11" class="outline-2">
<h2 id="orga1dce11"><span class="section-number-2">5</span> Or stick with AWS</h2>
</div>

<div id="outline-container-orgada693e" class="outline-2">
<h2 id="orgada693e"><span class="section-number-2">6</span> Rework the lesson ipython notebooks</h2>
</div>

<div id="outline-container-org21cbcd3" class="outline-2">
<h2 id="org21cbcd3"><span class="section-number-2">7</span> Explore the notebooks</h2>
</div>

<div id="outline-container-orga3a32a7" class="outline-2">
<h2 id="orga3a32a7"><span class="section-number-2">8</span> Pytorch</h2>
</div>

<div id="outline-container-orgc6b4851" class="outline-2">
<h2 id="orgc6b4851"><span class="section-number-2">9</span> Look at your data</h2>
</div>

<div id="outline-container-orgae4d209" class="outline-2">
<h2 id="orgae4d209"><span class="section-number-2">10</span> Theory &lt; Practical Code</h2>
</div>

<div id="outline-container-orgeecef52" class="outline-2">
<h2 id="orgeecef52"><span class="section-number-2">11</span> Infinitely Flexible Function</h2>
<div class="outline-text-2" id="text-11">
</div>
<div id="outline-container-orga1228ac" class="outline-3">
<h3 id="orga1228ac"><span class="section-number-3">11.1</span> All-purpose parameter fitting</h3>
</div>
</div>

<div id="outline-container-org6775480" class="outline-2">
<h2 id="org6775480"><span class="section-number-2">12</span> Convolutional Neural Network</h2>
</div>

<div id="outline-container-orgd476470" class="outline-2">
<h2 id="orgd476470"><span class="section-number-2">13</span> Find Learning Rate &#x2013; plot learning rate over time</h2>
</div>

<div id="outline-container-org1a2e8fe" class="outline-2">
<h2 id="org1a2e8fe"><span class="section-number-2">14</span> Find the number of epochs</h2>
</div>

<div id="outline-container-org588b33e" class="outline-2">
<h2 id="org588b33e"><span class="section-number-2">15</span> <code>[5/9]</code> Homework</h2>
<div class="outline-text-2" id="text-15">
</div>
<div id="outline-container-org2bdc924" class="outline-3">
<h3 id="org2bdc924"><span class="section-number-3">15.1</span> <span class="done DONE">DONE</span> Setup Tmux</h3>
</div>
<div id="outline-container-orge048931" class="outline-3">
<h3 id="orge048931"><span class="section-number-3">15.2</span> <span class="todo WAITING">WAITING</span> Setup paperspace cli &#x2013; In beta stage</h3>
</div>
<div id="outline-container-org351647d" class="outline-3">
<h3 id="org351647d"><span class="section-number-3">15.3</span> <span class="done DONE">DONE</span> Get comfortable with Jupyter and all other tools</h3>
</div>
<div id="outline-container-org23bf280" class="outline-3">
<h3 id="org23bf280"><span class="section-number-3">15.4</span> <span class="done DONE">DONE</span> Run week1 code and understand it &#x2026; Play with code to understand it</h3>
</div>
<div id="outline-container-orgae92e6f" class="outline-3">
<h3 id="orgae92e6f"><span class="section-number-3">15.5</span> <span class="todo IN_PROGRESS">IN-PROGRESS</span> Try different learning rates, epochs while running code</h3>
</div>
<div id="outline-container-orga3bb296" class="outline-3">
<h3 id="orga3bb296"><span class="section-number-3">15.6</span> <span class="todo IN_PROGRESS">IN-PROGRESS</span> Feel free to explore week2 notebook</h3>
</div>
<div id="outline-container-org905d414" class="outline-3">
<h3 id="org905d414"><span class="section-number-3">15.7</span> <span class="done DONE">DONE</span> Recreate notebook &#x2013; Imitate</h3>
</div>
<div id="outline-container-org218efa2" class="outline-3">
<h3 id="org218efa2"><span class="section-number-3">15.8</span> <span class="todo TODO">TODO</span> Apply to another data set or other images</h3>
<div class="outline-text-3" id="text-15-8">
</div>
<div id="outline-container-org1fc1692" class="outline-4">
<h4 id="org1fc1692"><span class="section-number-4">15.8.1</span> How to quickly download images from google?</h4>
</div>
</div>
<div id="outline-container-org5d82f4e" class="outline-3">
<h3 id="org5d82f4e"><span class="section-number-3">15.9</span> <span class="done DONE">DONE</span> Setup environment on crestle/aws/paperspace</h3>
</div>
</div>



<div id="outline-container-orgc3964a1" class="outline-2">
<h2 id="orgc3964a1"><span class="section-number-2">16</span> Tmux Notes:</h2>
<div class="outline-text-2" id="text-16">
<p>
<a href="https://gist.github.com/andreyvit/2921703">https://gist.github.com/andreyvit/2921703</a>
</p>
<ul class="org-ul">
<li>tmux new -s</li>
<li>tmux a -t myname</li>
<li>tmux a 4</li>
<li>tmux ls</li>
<li>tmux kill-session -t myname</li>
<li>tmux list-keys | less</li>
<li>Panes ctrl-a
<ul class="org-ul">
<li>% vertical split</li>
<li>" horizontal split</li>
<li>d detach from session</li>
<li>x kill</li>
<li>arrow keys move panes (except up/down)</li>
<li>{ } o</li>
<li>Resizing only works left and right</li>
<li>q</li>
</ul></li>
<li>Windows ctrl-a
<ul class="org-ul">
<li>c</li>
<li>w list</li>
<li>n</li>
<li>p</li>
<li>&amp;</li>
<li>,</li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Monib Ahmed</p>
<p class="date">Created: 2018-01-31 Wed 09:35</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
